my_run/MyFGM_example/Sandia chn/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    wall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          8120;
        startFace       635402;
    }
    outlet
    {
        type            patch;
        nFaces          1507;
        startFace       643522;
    }
    sym_yz
    {
        type            symmetry;
        inGroups        List<word> 1(symmetry);
        nFaces          11588;
        startFace       645029;
    }
    sym_xz
    {
        type            symmetry;
        inGroups        List<word> 1(symmetry);
        nFaces          11588;
        startFace       656617;
    }
    inlet_air
    {
        type            patch;
        nFaces          1350;
        startFace       668205;
    }
    wall_inlet
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1216;
        startFace       669555;
    }
    inlet_fuel
    {
        type            patch;
        nFaces          93;
        startFace       670771;
    }
)

// ************************************************************************* //
