my_run/MyFGM_example/Sandia chn/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0.7);

boundaryField
{
	wall
    {
        type            zeroGradient;
    }
	outlet
    {
        type            pressureInletOutletVelocity;
        value           $internalField;
    }
	sym_yz
    {
        type            symmetry;
    }
	sym_xz
    {
        type            symmetry;
    }
    inlet_air
    {
        type            fixedValue;
        value           uniform (0 0 0.7);
    }
	wall_inlet
    {
        type            zeroGradient;
    }
	inlet_fuel
    {
        type            fixedValue;
        value           uniform (0 0 76.0);
    }
}


// ************************************************************************* //
