my_run/MyFGM_example/Sandia chn/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField
{
	wall
    {
        type            zeroGradient;
    }
	outlet
    {
        type            totalPressure;
        gamma           1.4;
        p0              $internalField;
    }
	sym_yz
    {
        type            symmetry;
    }
	sym_xz
    {
        type            symmetry;
    }
    inlet_air
    {
        type            zeroGradient;
    }
	wall_inlet
    {
        type            zeroGradient;
    }
	inlet_fuel
    {
        type            zeroGradient;
    }
    wallTube
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
