my_run/MyFGM_example/Sandia chn/0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
	wall
    {
        type            zeroGradient;//compressible::alphatWallFunction;
		//Prt             0.85;
	    value           uniform 0;
    }
	outlet
    {
        type            calculated;
        value           uniform 0;
    }
	sym_yz
    {
        type            symmetry;
    }
	sym_xz
    {
        type            symmetry;
    }
    inlet_air
    {
        type            calculated;
        value           uniform 0;
    }
	wall_inlet
    {
        type            zeroGradient;//compressible::alphatWallFunction;
		//Prt             0.85;
	    value           uniform 0;
    }
	inlet_fuel
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
