my_run/MyFGM_example/Sandia chn/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 30000;

boundaryField
{
	wall
    {
        type            epsilonWallFunction;
        value           uniform 30000;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 30000;
    }
	outlet
    {
        type            zeroGradient;
    }
	sym_yz
    {
        type            symmetry;
    }
	sym_xz
    {
        type            symmetry;
    }
    inlet_air
    {
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.021;
        phi             phi;
        k               k;
        value           uniform 1;
    }
	wall_inlet
    {
        type            epsilonWallFunction;
        value           uniform 30000;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 30000;
    }
	inlet_fuel
    {
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.000161;
        phi             phi;
        k               k;
        value           uniform 1;
    }
}


// ************************************************************************* //
