my_run/MyFGM_example/Sandia chn/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 1;

boundaryField
{
	wall
    {
        type            zeroGradient;
    }
	outlet
    {
        type            inletOutlet;
        value           uniform 1;
        inletValue      uniform 1;
    }
	sym_yz
    {
        type            symmetry;
    }
	sym_xz
    {
        type            symmetry;
    }
    inlet_air
    {
        type            fixedValue;
        value           uniform 1;
    }
	wall_inlet
    {
        type            zeroGradient;
    }
	inlet_fuel
    {
        type            fixedValue;
        value           uniform 1;
    }
}


// ************************************************************************* //
